# SQL-запросы к базе данных сервиса по продаже книг

# Описание проекта

**Цель исследования:** проанализировать базу данных, которая содержит информацию о книгах, издательствах, авторах, а также пользовательские обзоры кни, для формулировки ценностного предложение для нового продукта по чтению книг.

**Задачи исследования:**
- выяснить, сколько книг вышло после 1 января 2000 года;
- посчитать количество обзоров и среднюю оценку каждой книги;
- определить издательство, которое выпустило наибольшее число книг толще 50 страниц;
- определить автора с самой высокой средней оценкой книг — учитывая только книги с 50 и более оценками;
- посчитать среднее количество обзоров от пользователей, которые поставили больше 48 оценок.

# Описание данных

**Таблица books**

Содержит данные о книгах:
- book_id — идентификатор книги;
- author_id — идентификатор автора;
- title — название книги;
- num_pages — количество страниц;
- publication_date — дата публикации книги;
- publisher_id — идентификатор издателя.

**Таблица authors**

Содержит данные об авторах:
- author_id — идентификатор автора;
- author — имя автора.

**Таблица publishers**

Содержит данные об издательствах:
- publisher_id — идентификатор издательства;
- publisher — название издательства.

**Таблица ratings**

Содержит данные о пользовательских оценках книг:
- rating_id — идентификатор оценки;
- book_id — идентификатор книги;
- username — имя пользователя, оставившего оценку;
- rating — оценка книги.

**Таблица reviews**

Содержит данные о пользовательских обзорах:
- review_id — идентификатор обзора;
- book_id — идентификатор книги;
- username — имя автора обзора;
- text — текст обзора.

# Доступ к базе данных данных

In [1]:
# импортируем библиотеки
import pandas as pd
from sqlalchemy import text, create_engine
import sqlalchemy as sa

In [2]:
# устанавливаем параметры
db_config = {'user': 'praktikum_student', # имя пользователя
'pwd': 'Sdf4$2;d-d30pp', # пароль
'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
'port': 6432, # порт подключения
'db': 'data-analyst-final-project-db'} # название базы данных
connection_string = 'postgresql://{user}:{pwd}@{host}:{port}/{db}'.format(**db_config)
# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

In [3]:
# чтобы выполнить SQL-запрос, используем Pandas
query = '''SELECT * FROM books LIMIT 5'''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query), con = con)

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

# Изучение информации о таблицах

In [4]:
def data_head(query:str, engine:sa.engine.base.Engine=engine) -> pd.DataFrame:
    '''Функция для вывода первых 5 строк таблицы'''
    with engine.connect() as con:
        return pd.read_sql(sql=sa.text(query), con = con)

**Таблица books**

In [5]:
data_head('''SELECT * FROM books LIMIT 5''')

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

**Таблица authors**

In [6]:
data_head('''SELECT * FROM authors LIMIT 5''')

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

**Таблица publishers**

In [7]:
data_head('''SELECT * FROM publishers LIMIT 5''')

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

**Таблица ratings**

In [8]:
data_head('''SELECT * FROM ratings LIMIT 5''')

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

**Таблица reviews**

In [9]:
data_head('''SELECT * FROM reviews LIMIT 5''')

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

# Запросы к базе данных

## Cколько книг вышло после 1 января 2000 года

In [10]:
books_2000 = '''SELECT COUNT(*)
                FROM books
                WHERE publication_date > '2000-01-01'
                '''

data_books_2000 = pd.io.sql.read_sql(books_2000, con = engine)
print('После 1 января 2020 года вышло {} книга '.format(data_books_2000.loc[0, 'count']))

После 1 января 2020 года вышло 819 книга

## Количество обзоров и средняя оценка каждой книги

In [11]:
rating = '''SELECT b.title,
            COUNT (DISTINCT rw.review_id), ROUND (avg(r.rating), 2) as R
            FROM REVIEWS AS rw
            RIGHT OUTER JOIN BOOKS AS b ON rw.book_id=b.book_id
            LEFT OUTER JOIN RATINGS AS r ON b.book_id = r.book_id
            GROUP BY b.book_id
            ORDER BY R DESC'''

book_rating = pd.io.sql.read_sql(rating, con = engine)
book_rating.columns = ['Название книги', 'Количество обзоров', 'Средняя оценка']
book_rating

,Название книги,Количество обзоров,Средняя оценка
0,Arrows of the Queen (Heralds of Valdemar #1),2,5.00
1,The Walking Dead Book One (The Walking Dead #...,2,5.00
2,Light in August,2,5.00
3,Wherever You Go There You Are: Mindfulness Me...,2,5.00
4,Captivating: Unveiling the Mystery of a Woman'...,2,5.00
...,...,...,...
995,The World Is Flat: A Brief History of the Twen...,3,2.25
996,His Excellency: George Washington,2,2.00
997,Drowning Ruth,3,2.00
998,Junky,2,2.00
999,Harvesting the Heart,2,1.50

## Издательство, которое выпустило наибольшее число книг толще 50 страниц

In [12]:
books_max = '''SELECT p.publisher,
               COUNT(b.book_id)
               FROM publishers AS p
               JOIN BOOKS AS b ON p.publisher_id=b.publisher_id
               WHERE b.num_pages > 50
               GROUP BY p.publisher_id
               ORDER BY count(b.book_id) DESC
               LIMIT 1'''

max_books = pd.io.sql.read_sql(books_max, con = engine)
max_books
display(max_books)
print('Издательство, которое выпустило наибольшее число книг толще 50 страниц -', max_books.loc[0, 'publisher'])

       publisher  count
0  Penguin Books     42

Издательство, которое выпустило наибольшее число книг толще 50 страниц - Penguin Books

## Автор с самой высокой средней оценкой книг — учитывая только книги с 50 и более оценками

In [13]:
autor_max = '''
WITH book_r AS (
    SELECT 
        b.author_id,
        b.book_id,
        AVG(r.rating) avg_rating
    FROM books AS b
    JOIN ratings AS r ON b.book_id=r.book_id
    GROUP BY b.book_id
    HAVING count(r.rating_id)>=50
)

SELECT 
    a.author,
    AVG(br.avg_rating) avg_rating,
    COUNT(br.avg_rating) books_count -- и выведем количество книг, по которым прошел подсчет среднего
FROM authors AS a
JOIN book_r AS br ON a.author_id=br.author_id

GROUP BY a.author
ORDER BY avg_rating desc
'''

max_autor = pd.io.sql.read_sql(autor_max, con = engine)
display(max_autor)
print('Автор с самой высокой средней оценкой книг -', max_autor.loc[0, 'author'])

                                               author  avg_rating  books_count
0                          J.K. Rowling/Mary GrandPré    4.283844            4
1                   Markus Zusak/Cao Xuân Việt Khương    4.264151            1
2                                      J.R.R. Tolkien    4.258446            2
3                                   Louisa May Alcott    4.192308            1
4                                        Rick Riordan    4.080645            1
5                                     William Golding    3.901408            1
6                                       J.D. Salinger    3.825581            1
7            Paulo Coelho/Alan R. Clarke/Özdemir İnce    3.789474            1
8   William Shakespeare/Paul Werstine/Barbara A. M...    3.787879            1
9                                           Dan Brown    3.754540            2
10                                         Lois Lowry    3.750000            1
11            George Orwell/Boris Grabnar/Peter Škerl    3.729730            1
12                                    Stephenie Meyer    3.662500            1
13                                     John Steinbeck    3.622951            1

Автор с самой высокой средней оценкой книг - J.K. Rowling/Mary GrandPré

## Среднее количество обзоров от пользователей, которые поставили больше 48 оценок

In [14]:
mean_users = '''WITH A AS
                    (SELECT username,
                     COUNT(review_id)
                     FROM reviews
                     WHERE username in
                         (SELECT username
                          FROM ratings
                          GROUP BY username
                          HAVING count(rating_id)>48)
                    GROUP BY username)
                SELECT round (SUM (COUNT) / COUNT(COUNT), 2) AS AVG
                FROM A'''

users_mean = pd.io.sql.read_sql(mean_users, con = engine)
users_mean
print ('Среднее количество обзоров от пользователей, которые поставили больше 48 оценок, составляет ', users_mean.loc[0, 'avg'])

Среднее количество обзоров от пользователей, которые поставили больше 48 оценок, составляет  24.0